# AssemblyMemberDifferentGeometry Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyMemberDifferentGeometry Class
Members See Also
---
The two assembly members being compared have different geometry
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class AssemblyMemberDifferentGeometry : AssemblyMemberDifference
```

Visual Basic
---
```text
Public Class AssemblyMemberDifferentGeometry _
	Inherits AssemblyMemberDifference
```

Visual C++
---
```text
public ref class AssemblyMemberDifferentGeometry : public AssemblyMemberDifference
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..AssemblyMemberDifference Autodesk.Revit.DB..::..AssemblyMemberDifferentGeometry
# See Also
AssemblyMemberDifferentGeometry Members
Autodesk.Revit.DB Namespace